app/controllers/passwords_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "aayushi@gmail.com"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(email: params[:email])
    ResetPasswordMailer.with(user: @user).reset_password.deliver_now