app/controllers/registrations_controller.rb

INSERT INTO "users" ("full_name", "email", "phone_number", "password_digest", "user_name", "created_at", "updated_at", "otp") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def create
    @user = User.new user_params
    @user.otp = SecureRandom.alphanumeric(4)
    if @user.save
      session[:user_id] = @user.id
      UserMailer.with(user: @user).welcome_email.deliver_now