app/controllers/sessions_controller.rb

  def create
    user = User.find_by(user_name: params[:name])
---
SELECT "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "prashant"], ["LIMIT", 1]]

  def check_valid_otp
    user = User.find_by(id: session[:user_id])
    if params[:otp] == user.otp
      user.update(otp_verified: true)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "otp_verified" = ? WHERE "users"."id" = ?  [["updated_at", "2022-10-26 08:34:50.352750"], ["otp_verified", 1], ["id", 1]]