app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("full_name", "email", "phone_number", "password_digest", "user_name", "created_at", "updated_at", "otp") VALUES (?, ?, ?, ?, ?, ?, ?, ?)