app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit_password
    @user = User.find_by(id: params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$L.6cKuuqAec/Qb/pgLQIaO8Zys0HyIS7IuSIO1PWRSbMZjV.MRNvS"], ["updated_at", "2022-10-31 13:01:48.847631"], ["id", 1]]
---
  def update_password
    user = User.find(params[:user_id])

    if user.update(password: params[:user][:password])